    // ! Задача 1
    // Напишите функцию приветствия с языками программирования.
    // Аргументом передаем название языка программирования
    // В результате функция должна вывести в консоль "Привет, о прекрасный языка программирования ИмяЗыка"
    // Дополнительное условие, если язык Kotlin, то в конце строки добавляем смайлики сердечка

    // ? Нужно будет использовать метод строки toLowerCase(). Как думаете зачем?

    // НАЧАЛО
    // Пишите код ниже здесь

    // КОНЕЦ

    
    // ! Задача 2
    // Написать 4 функции для калькулятора
    // Функция сложения двух чисел
    // Функция вычитания двух чисел
    // Функция умножения двух чисел
    // Функция деления двух чисел (Обязательно обработать условие деления на ноль :)
    // Результат функций присвоить в переменные и вывести результат в консоль

    // НАЧАЛО
    // Пишите код ниже здесь

    // КОНЕЦ

    // ! Задача 3 
    // Написать функцию, которая принимаем целое число N.
    // Функция должна вернуть сумму всех четных чисел от 0 до N
    
    // НАЧАЛО
    // Пишите код ниже здесь

    // КОНЕЦ

    // ! Задача 4
    // Написать 2 функции
    // Первая находит минимальный элемент из 3 переданных аргументов
    // Вторая находит минимальный элемент из 3 переданных аргументов
    
    // НАЧАЛО
    // Пишите код ниже здесь

    // КОНЕЦ