// Задача 1
// Дан массив с числами. Посчитайте количество отрицательных чисел в этом массиве
let arr = [4,3,2,1,0,-1,-2,-3,-4,]
let sum = 0
arr.filter(item => item <
// Задача 2
// Дан массив с числами. Оставьте в нем только положительные числа. Затем извлеките квадратный корень и этих чисел.

// Задача 3
// Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы

// Задача 4
// Дан массив с числами. Найдите сумму первых N элементов до первого нуля. Пример: [1, 2, 3, 0, 4, 5, 6] - суммируем первые 3 элемента, так как дальше стоит элемент с числом 0.