    // ! Задача 1
    // Напишите функцию которая проверяет содержится ли элемент в массиве/списке
    // Если содержится, то возвращает true иначе false

    // НАЧАЛО
    // Пишите код ниже здесь
//let m = prompt()

//function include(m) {    
//    let arr = ["z","x","c","4"]
    
//    for(let i = 0; i < arr.length; i++) {
//        if(m == arr[i]){
//            return true
//        }
//    }
//    return false
    
//}

//alert(include(m))
    // КОНЕЦ

    // ! Задача 1.1
    // Напишите тоже самое используя готовые методы для массивов или списков
//let m = prompt()
//let arr = ["z","x","c","4"]
//alert(arr.includes(m))
    
    // ! Задача 2
    // Напишите функцию. Найти наибольшее и наименьшее число в массиве

    // НАЧАЛО
    // Пишите код ниже здесь
// let arr = [123,321,12,32]
// let m = arr[0]
//     function qwe(n){
// for(let i = 0; i < n.length; i++){
//         if(arr[i] < m){
//             m = arr[i]
//         }
// }
// return m
//     }
// console.log(qwe(arr))
// function max(x){
//     for(let i = 0; i < x.length; i++){
//         if(arr[i] > m){
//             m = arr[i]
//         }
//     }
//     return m
// }
// console.log(max(arr))
    // КОНЕЦ

    // ! Задача 2.2
    // Напишите тоже самое используя готовые методы для массивов или списков


    // ! Задача 3
    // Напишите функцию. Найти среднее значение чисел в массиве
    
    // НАЧАЛО
    // Пишите код ниже здесь
// let srd = 0
// let arr = [1,2,3,4]
//     function sr(x){
//         for(let i = 0; i < x.length; i++){
//             srd = srd + x[i]
//         }
//         let sr = srd / x.length
//         console.log(sr)
//     }
// sr(arr)
    // КОНЕЦ

    // ! Задача 3.3
    // Напишите тоже самое используя готовые методы для массивов или списков


    // ! Задача 4
    // Напишите функцию. Подсчитать сумму чисел в массиве
    // let sum = 0
    // let arr = [1,2,3,4]
    //     function suma(x){
    //         for(let i = 0; i < x.length; i++){
    //             sum = sum + x[i]
    //         }
    //         console.log(sum)
    //     }
    // suma(arr)
    // НАЧАЛО
    // Пишите код ниже здесь

    // КОНЕЦ

    // ! Задача 4.4
    // Напишите тоже самое используя готовые методы для массивов или списков


    // ! Задача 5
    // Напишите функцию. Отсортируйте список чисел по возрастанию
    

    // НАЧАЛО
    // Пишите код ниже здесь
let n = arr[0]
let arr = [6,10,3,4]
function sor(x){
    for(let i = 0; i < x.length; i++){
        
    }
}
    // КОНЕЦ

    // ! Задача 5.5
    // Напишите тоже самое используя готовые методы для массивов или списков
